; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_2 ?v2 - type_1 ?v6 - type_2)
 	      (pred_4 ?v4 - object ?v6 - type_2)
	      (pred_3 ?v2 - type_1 ?v5 - type_3)
	      (pred_1 ?v2 - type_1 ?v4 - object ?v5 - type_3))

   (:action op_3
       :parameters  (?v2 - type_1 ?v8 ?v3 - type_2)
       :precondition (and  (pred_2 ?v2 ?v8))
       :effect (and  (pred_2 ?v2 ?v3)
		     (not (pred_2 ?v2 ?v8))))

   (:action op_2
       :parameters (?v2 - type_1 ?v7 - object ?v1 - type_2 ?v5 - type_3)
       :precondition  (and  (pred_4 ?v7 ?v1) (pred_2 ?v2 ?v1) (pred_3 ?v2 ?v5))
       :effect (and (pred_1 ?v2 ?v7 ?v5)
		    (not (pred_4 ?v7 ?v1)) 
		    (not (pred_3 ?v2 ?v5))))

   (:action op_1
       :parameters (?v2 - type_1 ?v7 - object ?v1 - type_2 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v2 ?v7 ?v5) (pred_2 ?v2 ?v1))
       :effect (and (pred_4 ?v7 ?v1)
		    (pred_3 ?v2 ?v5)
		    (not (pred_1 ?v2 ?v7 ?v5)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_03 obj_09 - type_1
obj_08 obj_07 obj_06 obj_05 - type_3
obj_02 obj_10 obj_11 - type_2
obj_04 obj_01 - object)
(:init
(pred_2 obj_03 obj_11)
(pred_3 obj_03 obj_08)
(pred_3 obj_03 obj_07)
(pred_2 obj_09 obj_02)
(pred_3 obj_09 obj_06)
(pred_3 obj_09 obj_05)
(pred_4 obj_04 obj_11)
(pred_4 obj_01 obj_02)
)
(:goal
(and
(pred_4 obj_04 obj_11)
(pred_4 obj_01 obj_11)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_03 obj_11) (pred_2 obj_09 obj_11))))
  )
)
)

; plan
1. (op_2 obj_09 obj_01 obj_02 obj_05)
   deleted: (pred_4 obj_01 obj_02) (pred_3 obj_09 obj_05)
   added: (pred_1 obj_09 obj_01 obj_05)
   goals met: 1 of 2
2. (op_3 obj_03 obj_11 obj_02)
   deleted: (pred_2 obj_03 obj_11)
   added: (pred_2 obj_03 obj_02)
   goals met: 1 of 2
3. (op_3 obj_09 obj_02 obj_11)
   deleted: (pred_2 obj_09 obj_02)
   added: (pred_2 obj_09 obj_11)
   goals met: 1 of 2
4. (op_1 obj_09 obj_01 obj_11 obj_05)
   deleted: (pred_1 obj_09 obj_01 obj_05)
   added: (pred_4 obj_01 obj_11) (pred_3 obj_09 obj_05)
   goals met: 2 of 2
